УчетВУправляющихДляГит1/src/InformationRegisters/ДопустимыеСочетанияКодовГруппСтажа/ДопустимыеСочетанияКодовГруппСтажа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДопустимыеСочетанияКодовГруппСтажа</name>
  <attributes>
    <name>ТипШаблонаКПС</name>
    <comment>Тип шаблона кода позиции списка</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>НомерПравила</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодУсловийТруда</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПозицииСписка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодОснованияИсчисляемогоСтажа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ФорматФОВ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодОснованияВыслугиЛет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/InformationRegisters/ДопустимыеСочетанияКодовГруппСтажа/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура НачальноеЗаполнение() Экспорт
	
	ЗаполнитьПравилаПроверкиСочетанийСтажа();
	
КонецПроцедуры

Процедура ЗаполнитьПравилаПроверкиСочетанийСтажа()
	
	Если ОбменДаннымиСервер.ЭтоАвтономноеРабочееМесто() Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
	
	Макет = ПолучитьМакет("СочетанияГруппСтажа");
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	
	Макет.Записать(ИмяВременногоФайла);
	
	ТаблицаСочетанийСтажа = ЗначениеИзФайла(ИмяВременногоФайла);
	
	Для Каждого СтрокаТаблицыСочетаний Из ТаблицаСочетанийСтажа Цикл
		ЗаписьСочетания = НаборЗаписей.Добавить();
		
		ЗаписьСочетания.НомерПравила = СокрЛП(СтрокаТаблицыСочетаний.НомерПравила);
		ЗаписьСочетания.КодУсловийТруда = СокрЛП(СтрокаТаблицыСочетаний.КодУсловийТруда);
		ЗаписьСочетания.КодПозицииСписка = СокрЛП(СтрокаТаблицыСочетаний.КодПозицииСписка);
		ЗаписьСочетания.КодОснованияИсчисляемогоСтажа = СокрЛП(СтрокаТаблицыСочетаний.КодОснованияИсчисляемогоСтажа);
		ЗаписьСочетания.ФорматФОВ = СокрЛП(СтрокаТаблицыСочетаний.ФорматФОВ);
		ЗаписьСочетания.КодОснованияВыслугиЛет = СокрЛП(СтрокаТаблицыСочетаний.КодОснованияВыслугиЛет);
		ЗаписьСочетания.ТипШаблонаКПС = СокрЛП(СтрокаТаблицыСочетаний.ТипШаблонаКПС);
		
		ЗаписьСочетания.ПериодС = Число(СтрокаТаблицыСочетаний.ПериодС);
		ЗаписьСочетания.ПериодПо = Число(СтрокаТаблицыСочетаний.ПериодПо);
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
